In [1]:
import pandas as pd

In [19]:
data_url= "http://www-stat.wharton.upenn.edu/~waterman/DataSets/uva.txt"
df = pd.read_table(data_url)

In [20]:
df.shape

(19583, 11)

In [3]:
df[:5]

,who,Newbie,Age,Gender,Household Income,Sexual Preference,Country,Education Attainment,Major Occupation,Marital Status,Years on Internet
0,id74364,0,54.0,Male,$50-74,Gay male,Ontario,Some College,Computer,Other,4-6 yr
1,id84505,0,39.0,Female,Over $100,Heterosexual,Sweden,Professional,Other,Other,1-3 yr
2,id84509,1,49.0,Female,$40-49,Heterosexual,Washington,Some College,Management,Other,Under 6 mo
3,id87028,1,22.0,Female,$40-49,Heterosexual,Florida,Some College,Computer,Married,6-12 mo
4,id76087,0,20.0,Male,$30-39,Bisexual,New Jersey,Some College,Education,Single,1-3 yr

In [10]:
df_category_only = df.drop(['who', "Age", "Years on Internet"] , axis=1)
df_category_only[:5]

,Newbie,Gender,Household Income,Sexual Preference,Country,Education Attainment,Major Occupation,Marital Status
0,0,Male,$50-74,Gay male,Ontario,Some College,Computer,Other
1,0,Female,Over $100,Heterosexual,Sweden,Professional,Other,Other
2,1,Female,$40-49,Heterosexual,Washington,Some College,Management,Other
3,1,Female,$40-49,Heterosexual,Florida,Some College,Computer,Married
4,0,Male,$30-39,Bisexual,New Jersey,Some College,Education,Single

In [21]:
for col in ['Gender','Household Income', 'Sexual Preference', 'Education Attainment', 'Major Occupation', "Marital Status", "Country"]:
    df_category_only[col] = df_category_only[col].astype('category')
df_category_only.dtypes

Newbie                     int64
Gender                  category
Household Income        category
Sexual Preference       category
Country                 category
Education Attainment    category
Major Occupation        category
Marital Status          category
dtype: object

In [24]:
df_category_only = df_category_only.dropna()

In [25]:
df_dummies = pd.get_dummies(df_category_only)
df_dummies[:5]

,Newbie,Gender_Female,Gender_Male,Household Income_$10-19,Household Income_$20-29,Household Income_$30-39,Household Income_$40-49,Household Income_$50-74,Household Income_$75-99,Household Income_Over $100,...,Major Occupation_Education,Major Occupation_Management,Major Occupation_Other,Major Occupation_Professional,Marital Status_Divorced,Marital Status_Married,Marital Status_Other,Marital Status_Separated,Marital Status_Single,Marital Status_Widowed
0,0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
1,0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,...,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
2,1,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
3,1,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
4,0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0

In [27]:
df_dummies.shape

(15553, 179)

In [29]:
x_data = df_dummies.ix[:, 1:].values
y_data = df_dummies.ix[:, 0].reshape(-1,1)

y_data.shape, x_data.shape

((15553, 1), (15553, 178))

In [35]:
sum(y_data.ravel() == 0)

11680